# GetExposedFaces Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarHostData..::..GetExposedFaces Method
RebarHostData Class See Also
---
Returns all the exposed faces, that is, those that have an associated CoverType.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<Reference> GetExposedFaces()
```

Visual Basic
---
```text
Public Function GetExposedFaces As IList(Of Reference)
```

Visual C++
---
```text
public:
IList<Reference^>^ GetExposedFaces()
```

# See Also
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace